# IsHVACSystemTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FlexDuct..::..IsHVACSystemTypeId Method
FlexDuct Class See Also
---
Checks if given type is valid HVAC system type.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsHVACSystemTypeId(
	Document document,
	ElementId systemTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsHVACSystemTypeId ( _
	document As Document, _
	systemTypeId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsHVACSystemTypeId(
	Document^ document,
	ElementId^ systemTypeId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
systemTypeId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the HVAC system type to check.
# ### Return Value
True if the given systemTypeId is the HVAC system type, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace